In [3]:
import pandas as pd

In [4]:
s = pd.Series([9904312, 3448737, 2890451, 2466052],
              index=["서울", "부산", "인천", "대구"])
s

서울    9904312
부산    3448737
인천    2890451
대구    2466052
dtype: int64

In [ ]:
pd.DataFrame({
    컬럼명:리스트
})

In [9]:
pd.Series(range(10,14))

0    10
1    11
2    12
3    13
dtype: int64

In [10]:
s.index

Index(['서울', '부산', '인천', '대구'], dtype='object')

In [11]:
s.values

array([9904312, 3448737, 2890451, 2466052], dtype=int64)

In [8]:
data = {
    "2015": [9904312, 3448737, 2890451, 2466052],
    "2010": [9631482, 3393191, 2632035, 2431774],
    "2005": [9762546, 3512547, 2517680, 2456016],
    "위치": [1.2, 2.5, 7.2, 2.9],
    "지역": ["수도권", "경상권", "수도권", "경상권"],
 
}

df = pd.DataFrame(data)
df

      2015     2010     2005   위치   지역
0  9904312  9631482  9762546  1.2  수도권
1  3448737  3393191  3512547  2.5  경상권
2  2890451  2632035  2517680  7.2  수도권
3  2466052  2431774  2456016  2.9  경상권

In [12]:
data = {
    "국어": [80, 90, 70, 30],
    "영어": [90, 70, 60, 40],
    "수학": [90, 60, 80, 70],
}
columns = ["국어", "영어", "수학"]
index = ["춘향", "몽룡", "향단", "방자"]
df = pd.DataFrame(data, index=index, columns=columns)
df

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80
방자  30  40  70

In [21]:
df['수학'] #시리즈

춘향    90
몽룡    60
향단    80
방자    70
Name: 수학, dtype: int64

In [19]:
df[['국어','영어']] #데이터프레임

    국어  영어
춘향  80  90
몽룡  90  70
향단  70  60
방자  30  40

AttributeError: 'DataFrame' object has no attribute '춘향'

In [34]:
df['평균'] = df.mean()

국어    67.5
영어    65.0
수학    75.0
평균     NaN
dtype: float64

In [1]:
# 데이터를 바꿔주는게 inplace = True 
#

NameError: name 'titanic' is not defined